{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_6","layers":[{"class_name":"Dense","config":{"units":150,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense131","trainable":true,"batch_input_shape":[null,1],"dtype":"float32"}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense132","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense133","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense134","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense135","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense136","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense137","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense138","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense139","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense140","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense141","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense142","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense143","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense144","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense145","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense146","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense147","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense148","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense149","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense150","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense151","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense152","trainable":true}}]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./my-model.weights.bin"],"weights":[{"name":"dense_Dense131/kernel","shape":[1,150],"dtype":"float32"},{"name":"dense_Dense131/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense132/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense132/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense133/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense133/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense134/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense134/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense135/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense135/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense136/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense136/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense137/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense137/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense138/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense138/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense139/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense139/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense140/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense140/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense141/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense141/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense142/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense142/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense143/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense143/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense144/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense144/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense145/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense145/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense146/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense146/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense147/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense147/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense148/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense148/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense149/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense149/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense150/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense150/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense151/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense151/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense152/kernel","shape":[150,1],"dtype":"float32"},{"name":"dense_Dense152/bias","shape":[1],"dtype":"float32"}]}]}