{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_10","layers":[{"class_name":"Dense","config":{"units":150,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense106","trainable":true,"batch_input_shape":[null,1],"dtype":"float32"}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense107","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense108","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense109","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense110","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense111","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense112","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense113","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense114","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense115","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense116","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense117","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense118","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense119","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense120","trainable":true}},{"class_name":"Dense","config":{"units":150,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense121","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense122","trainable":true}}]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./my-model.weights.bin"],"weights":[{"name":"dense_Dense106/kernel","shape":[1,150],"dtype":"float32"},{"name":"dense_Dense106/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense107/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense107/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense108/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense108/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense109/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense109/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense110/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense110/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense111/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense111/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense112/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense112/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense113/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense113/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense114/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense114/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense115/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense115/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense116/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense116/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense117/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense117/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense118/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense118/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense119/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense119/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense120/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense120/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense121/kernel","shape":[150,150],"dtype":"float32"},{"name":"dense_Dense121/bias","shape":[150],"dtype":"float32"},{"name":"dense_Dense122/kernel","shape":[150,1],"dtype":"float32"},{"name":"dense_Dense122/bias","shape":[1],"dtype":"float32"}]}]}